app/views/clearance_batches/index.html.erb

        <td><%= l(clearance_batch.created_at, format: :short) %></td>
        <td><%= link_to clearance_batch.items.count, clearance_batch %></td>
---
SELECT COUNT(*) FROM "items"  WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]