app/views/clearance_batches/show.html.erb

  <tbody>
    <% @clearance_batch.items.each do |item| %>
---
SELECT "items".* FROM "items"  WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 3]]