app/controllers/clearance_batches_controller.rb

SELECT "clearance_batches".* FROM "clearance_batches"
---
  def index
    @clearance_batches  = ClearanceBatch.all

SELECT "items".* FROM "items"  WHERE "items"."status" = 'sellable' AND "items"."id" = 300
SELECT COUNT(*) FROM "items"  WHERE "items"."clearance_batch_id" = ?  [["clearance_batch_id", 1]]
INSERT INTO "clearance_batches" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2014-12-16 22:38:48.497442"], ["updated_at", "2014-12-16 22:38:48.497442"]]
---
  def create
    clearancing_status = ClearancingService.new.process_file(params[:csv_batch_file].tempfile)
    clearance_batch    = clearancing_status.clearance_batch
    alert_messages     = []
    if clearance_batch.persisted?
      flash[:notice]  = "#{clearance_batch.items.count} items clearanced in batch #{clearance_batch.id}"
    else
      alert_messages << "No new clearance batch was added"

SELECT  "clearance_batches".* FROM "clearance_batches"  WHERE "clearance_batches"."id" = ? LIMIT 1  [["id", 3]]
---
  def show
    @clearance_batch = ClearanceBatch.find(params[:id])