app/controllers/items_controller.rb

  def index
    @items = case params[:sort_by]
             when "status"
               Item.order(:status).all
             when "clearance"
               Item.order(:clearance_batch_id).all
             else
               Item.all
---
SELECT "items".* FROM "items"